app/controllers/auth_controller.rb

  def callback
    auth = request.env["omniauth.auth"]
    user = User.find_or_create_by_uid(auth["uid"])
---
INSERT INTO "users" ("created_at", "token", "uid", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 23 Nov 2012 05:10:33 UTC +00:00], ["token", nil], ["uid", "0ea32f2d3651262cffae8bb2658405e2"], ["updated_at", Fri, 23 Nov 2012 05:10:33 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."uid" = '0ea32f2d3651262cffae8bb2658405e2' LIMIT 1