app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "current_bid", "description", "details", "photo_content_type", "photo_file_name", "photo_file_size", "starting_bid", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = current_user
    @post = @user.posts.create(params[:post])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 AND "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @user = User.find(params[:user_id])
    @post = @user.posts.find(params[:id])